In [3]:
import os
import numpy as np
import pandas as pd

1.	Create a program that asks the user to enter their name and their age. Print out a message that tells them the year that they will turn 100 years old

In [2]:
# Ask user to enter the name and age
name = input('Enter your name')
age = input('Enter your age')
year = 2022 + (100-int(age))
print(name, 'will turn 100 years by the year', year)

Enter your nameJohn
Enter your age31
John will turn 100 years by the year 2091

2.	What is pandas groupby? Demonstrate with your own example

In [48]:
# Creating data array for the below mentioned table
dfArray4 = {'Age':[25,30,45,35,33,35,25,52,21,24,48,22,27,28,21,51,23],
            'Hair Color':['Black','Black','Red','Blond','Brown','Brown','Black','Brown','Blond','Blond','Black','Black','Brown','Black','Blond','Black','Brown'],
            'US Region':['Southwest','Northwest','Northeast','Southwest','Southwest','Northeast','Southwest','Southeast','Southwest','Northeast','Southwest','Southwest','Northeast','Southeast','Southeast','Northwest','Southeast'],
            'Validation':[1,1,1,0,0,0,0,0,1,0,1,0,0,1,1,0,1]  }

# Cteating data frame for the array
df7 = pd.DataFrame(dfArray4)

In [49]:
df7.groupby(['US Region'])['Age'].mean()

US Region
Northeast    32.750000
Northwest    40.500000
Southeast    31.000000
Southwest    29.857143
Name: Age, dtype: float64

3.	How to create a dataframe from list?

In [31]:
list1 = np.array([[1,2,3,4,5],['Six','Seven','Eight',9,10]])
pd.DataFrame(list1)

     0      1      2  3   4
0    1      2      3  4   5
1  Six  Seven  Eight  9  10

4.	What are the ways to combine the dataframe in pandas. Give an example for each

In [32]:
# we can combine dataframe in pandas row wise and column wise
listFir = np.array([['One',2],['Three',4],['Five',6]])
listSec = np.array([['Seven',8],['Nine',10],['Eleven',12]])
df1 = pd.DataFrame(listFir)
df2 = pd.DataFrame(listSec)

dfResult1 = pd.concat([df1,df2], axis = 0)
dfResult1

        0   1
0     One   2
1   Three   4
2    Five   6
0   Seven   8
1    Nine  10
2  Eleven  12

In [33]:
dfResult2 = pd.concat([df1,df2], axis = 1)
dfResult2

       0  1       0   1
0    One  2   Seven   8
1  Three  4    Nine  10
2   Five  6  Eleven  12

5.	What is the difference between list and tuples in Python?

List is immutable and we can change the values in the existing positions
Tuple is mutable and we can't change the values in the exisiting positions 
where as we have some ways to change it like changing tuple in to a list, dividing the tuple in to elements

In [20]:
list1 = [1,2,3,4,5]
tuple1 = (1,2,3,4,5)
list1[3]=30
list1

[1, 2, 3, 30, 5]

In [21]:
tuple1[3]= 30 # will get the below error as the tuple is mutable

TypeError: 'tuple' object does not support item assignment

6.	Find out the mean, median and standard deviation of this numpy array -> np.array([1,5,3,100,4,48])

In [11]:
list2 = np.array([1,5,3,100,4,48])
print('Mean: ',np.mean(list2))
print('Median: ',np.median(list2))
print('Standard Deviation: ',np.std(list2))

Mean:  26.833333333333332
Median:  4.5
Standard Deviation:  36.59424666377065

7.	How will you remove duplicate elements from a list?

In [25]:
list4 = [1,1,2,3,4,4,5,6] # converting list to a set will remove the duplicates
set1 = set(list4)
set1

{1, 2, 3, 4, 5, 6}

8.	What is a map() function in Python? Give an example

### Map function: 
Used to perform the operation on the values in the list and returns the result

In [15]:
list3 = list(range(5))
result = list(map(lambda x:(x*x),list3))
print(result)

[0, 1, 4, 9, 16]

9.	What is pass in Python?

In [26]:
# pass will not break the function it will simply passes the step and goes continue
for num in range(10):
    if num%2 == 0:
        pass
    else:
        print(num)

1
3
5
7
9

10.	What is vstack() in numpy? Give an example

### VStack
vstack in numpy is combining arrays in the vertical manner

In [19]:
list4 = np.array([[1,2],[3,4],[5,6]])
list5 = np.array([[7,8],[9,10],[11,12]])
np.vstack((list4,list5))

array([[ 1,  2],
       [ 3,  4],
       [ 5,  6],
       [ 7,  8],
       [ 9, 10],
       [11, 12]])